tutorials/CFD/29HROM4IncFlows/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 20;
NmodesUproj 5; // 10;
NmodesPout 20;
NmodesPproj 5; //10;
//NmodesSUPout 10;
//NmodesSUPproj 10;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;


finalTime 10;
//timeStep 2.5e-04;
//writeEvery 5e-02;

// Specific problem of a stationary case
// Boundary condition method, can be "lift" or "penalty"
//method  PPE;  // or "PPE"
//bcMethod penalty;


// Time-dependent boundary condition method, can be "yes" or "no"
//timedepbcMethod no;

// Time derivative scheme order, can be "first" or "second"
//timeDerivativeSchemeOrder second;



